// leftovers	
// ’'"
/*
["this is one thing", "and this is another thing", "there is one last thing", "nothing is here"];
*/

/*
ﾛﾇﾌｱｳｴｵﾔﾕﾖﾜﾎﾍ
ﾀﾃｲｽｶﾝﾅﾆﾗｾﾞﾟﾑ
ﾁﾄｼﾊｷｸﾏﾉﾘﾚｹ
ﾂｻｿﾋｺﾐﾓﾈﾙﾒ
*/
// var eStr = "abcdefghijklmnopqrstuvwxyz";
// var jStr = "あいうえおかきくけこさしすせそなにぬねのたちつてとはひふへほまみむめもらりるれろやゆよわをん";
// var kStr = "ㄱㄲㄴㄷㄸㄹㅁㅂㅃㅅㅆㅇㅈㅉㅊㅋㅌㅍㅎㅏㅐㅑㅒㅓㅔㅕㅖㅗㅛㅜㅠㅡㅣ";
// var tStr = "ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄐㄑㄒㄓㄔㄕㄖㄗㄘㄙㄚㄛㄜㄝㄞㄟㄠㄡㄢㄣㄤㄥㄦㄧㄨㄩ";
// var taiwaneseWordList = ["ㄓㄨˋ ㄧㄣ ㄈㄨˊ ㄏㄠˋ","ㄅㄨˋ","ㄆㄚˋ","ㄇㄨˇ","ㄈㄨˊ","ㄉㄚˋ","ㄊㄚ","ㄋㄧˇ","ㄌㄨˋ","ㄍㄠ","ㄎㄜˇ","ㄏㄜ","ㄐㄧˋ","ㄑㄧˋ","ㄒㄧ","ㄓ","ㄔ","ㄕˋ","ㄖˋ","ㄗㄠˇ","ㄘㄠˇ","ㄙˋ","ㄉㄚˋ","ㄇㄛˋ","ㄎㄜˋ","ㄧㄝˋ","ㄉㄞˋ","ㄨㄟˋ","ㄉㄠˋ","ㄊㄡ","ㄎㄢˋ","ㄏㄣˇ","ㄉㄤ","ㄈㄥ","ㄦˊ","ㄉㄧˋ","ㄐㄧㄚ","ㄉㄧㄝ"ˊ,"ㄆㄧㄠ"ˋ,"ㄉㄧㄡ","ㄑㄧㄢ"ˊ,"ㄆㄧㄣ","ㄋㄧㄤ"ˊ,"ㄅㄧㄥ","ㄔㄨ","ㄏㄨㄚ","ㄉㄨㄛ","ㄎㄨㄞ"ˋ,"ㄊㄨㄟ"ˋ,"ㄔㄨㄢ","ㄔㄨㄣ","ㄓㄨㄤ","ㄋㄨㄥ"ˋ,"ㄋㄩˇ","ㄌㄩㄝ"ˋ,"ㄑㄩㄢ"ˊ,"ㄑㄩㄣ"ˊ,"ㄒㄩㄥ","ㄇㄚ ","ㄇㄚˊ","ㄇㄚˇ","ㄇㄚˋ","ㄇㄚ˙"];
// var tVocab = "
// b ㄅ 不 bù ㄅㄨˋ
// p ㄆ 怕 pà ㄆㄚˋ
// m ㄇ 母 mŭ ㄇㄨˇ
// f ㄈ 服 fú ㄈㄨˊ
// d ㄉ 大 dà ㄉㄚˋ
// t ㄊ 他 tā ㄊㄚ
// n ㄋ 你 nǐ ㄋㄧˇ
// l ㄌ 路 lù ㄌㄨˋ
// g ㄍ 高 gāo ㄍㄠ
// k ㄎ 可 kě ㄎㄜˇ
// h ㄏ 喝 hē ㄏㄜ
// j ㄐ 季 jì ㄐㄧˋ
// q ㄑ 器 qì ㄑㄧˋ
// x ㄒ 西 xī ㄒㄧ
// zh ㄓ 知 zhī ㄓ
// ch ㄔ 吃 chī ㄔ
// sh ㄕ 是 shì ㄕˋ
// r ㄖ 日 rì ㄖˋ
// z ㄗ 早 zǎo ㄗㄠˇ
// c ㄘ 草 cǎo ㄘㄠˇ
// s ㄙ 四 sì ㄙˋ

// a ㄚ 大 dà ㄉㄚˋ
// o ㄛ 墨 mò ㄇㄛˋ
// e ㄜ 客 kè ㄎㄜˋ
// ê ㄝ 夜 yè ㄧㄝˋ
// ai ㄞ 代 dài ㄉㄞˋ
// ei ㄟ 位 wèi ㄨㄟˋ
// ao ㄠ 到 dào ㄉㄠˋ
// ou ㄡ 偷 tōu ㄊㄡ
// an ㄢ 看 kàn ㄎㄢˋ
// en ㄣ 很 hěn ㄏㄣˇ
// ang ㄤ 當 dāng ㄉㄤ
// eng ㄥ 風 fēng ㄈㄥ
// er ㄦ 而 ér ㄦˊ
// i ㄧ 地 dì ㄉㄧˋ
// ia ㄧ ㄚ 家 jiā ㄐㄧㄚ
// ie ㄧ ㄝ 跌 dié ㄉㄧㄝˊ
// iao ㄧ ㄠ 票 piào ㄆㄧㄠˋ
// iu ㄧ ㄡ 丟 diū ㄉㄧㄡ
// ian ㄧ ㄢ 前 qián ㄑㄧㄢˊ
// in ㄧ ㄣ 拼 pīn ㄆㄧㄣ
// iang ㄧ ㄤ 娘 niáng ㄋㄧㄤˊ
// ing ㄧ ㄥ 冰 bīng ㄅㄧㄥ
// u ㄨ 出 chū ㄔㄨ
// ua ㄨ ㄚ 花 huā ㄏㄨㄚ
// uo ㄨ ㄛ 多 duō ㄉㄨㄛ
// uai ㄨ ㄞ 快 kuài ㄎㄨㄞˋ
// ui ㄨ ㄟ 退 tuì ㄊㄨㄟˋ
// uan ㄨ ㄢ 穿 chuān ㄔㄨㄢ
// un ㄨ ㄣ 春 chūn ㄔㄨㄣ
// uang ㄨ ㄤ 裝 zhuāng ㄓㄨㄤ
// ong ㄨ ㄥ 弄 nòng ㄋㄨㄥˋ
// ü ㄩ 女 nǚ ㄋㄩˇ
// üe ㄩ ㄝ 略 lüè ㄌㄩㄝˋ
// üan ㄩ ㄢ 全 quán ㄑㄩㄢˊ
// ün ㄩ ㄣ 群 qún ㄑㄩㄣˊ
// iong ㄩ ㄥ 兄 xiōng ㄒㄩㄥ

// 1st mā ㄇㄚ 媽
// 2nd má ㄇㄚˊ 麻
// 3rd mǎ ㄇㄚˇ 馬
// 4th mà ㄇㄚˋ 罵
// 5th ma ㄇㄚ˙ 嗎"